zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/MCXA536/MCXA536_COMMON.h
/* TENBASET_PHY - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral T1S0 base address */
  #define T1S0_BASE                                (0x5002D000u)
  /** Peripheral T1S0 base address */
  #define T1S0_BASE_NS                             (0x4002D000u)
  /** Peripheral T1S0 base pointer */
  #define T1S0                                     ((TENBASET_PHY_Type *)T1S0_BASE)
  /** Peripheral T1S0 base pointer */
  #define T1S0_NS                                  ((TENBASET_PHY_Type *)T1S0_BASE_NS)
  /** Array initializer of TENBASET_PHY peripheral base addresses */
  #define TENBASET_PHY_BASE_ADDRS                  { T1S0_BASE }
  /** Array initializer of TENBASET_PHY peripheral base pointers */
  #define TENBASET_PHY_BASE_PTRS                   { T1S0 }
  /** Array initializer of TENBASET_PHY peripheral base addresses */
  #define TENBASET_PHY_BASE_ADDRS_NS               { T1S0_BASE_NS }
  /** Array initializer of TENBASET_PHY peripheral base pointers */
  #define TENBASET_PHY_BASE_PTRS_NS                { T1S0_NS }
#else
  /** Peripheral T1S0 base address */
  #define T1S0_BASE                                (0x4002D000u)
  /** Peripheral T1S0 base pointer */
  #define T1S0                                     ((TENBASET_PHY_Type *)T1S0_BASE)
  /** Array initializer of TENBASET_PHY peripheral base addresses */
  #define TENBASET_PHY_BASE_ADDRS                  { T1S0_BASE }
  /** Array initializer of TENBASET_PHY peripheral base pointers */
  #define TENBASET_PHY_BASE_PTRS                   { T1S0 }
#endif
/** Interrupt vectors for the TENBASET_PHY peripheral type */
#define TENBASET_PHY_IRQS                        { TENBASET_PHY0_IRQn }

/* TRDC - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral MBC0 base address */
  #define MBC0_BASE                                (0x500C9000u)
  /** Peripheral MBC0 base address */
  #define MBC0_BASE_NS                             (0x400C9000u)
  /** Peripheral MBC0 base pointer */
  #define MBC0                                     ((TRDC_Type *)MBC0_BASE)
  /** Peripheral MBC0 base pointer */
  #define MBC0_NS                                  ((TRDC_Type *)MBC0_BASE_NS)
  /** Array initializer of TRDC peripheral base addresses */
  #define TRDC_BASE_ADDRS                          { MBC0_BASE }
  /** Array initializer of TRDC peripheral base pointers */
  #define TRDC_BASE_PTRS                           { MBC0 }
  /** Array initializer of TRDC peripheral base addresses */
  #define TRDC_BASE_ADDRS_NS                       { MBC0_BASE_NS }
  /** Array initializer of TRDC peripheral base pointers */
  #define TRDC_BASE_PTRS_NS                        { MBC0_NS }
#else
  /** Peripheral MBC0 base address */
  #define MBC0_BASE                                (0x400C9000u)
  /** Peripheral MBC0 base pointer */
  #define MBC0                                     ((TRDC_Type *)MBC0_BASE)
  /** Array initializer of TRDC peripheral base addresses */
  #define TRDC_BASE_ADDRS                          { MBC0_BASE }
  /** Array initializer of TRDC peripheral base pointers */
  #define TRDC_BASE_PTRS                           { MBC0 }
#endif
/** Interrupt vectors for the TRDC peripheral type */
#define TRDC_IRQS                                { MBC0_IRQn }
#define MBC0_MEMORY_CFG_WORD_COUNT {1,2,4,1}
#define MBC1_MEMORY_CFG_WORD_COUNT {1,1,1,1}
#define MBC2_MEMORY_CFG_WORD_COUNT {9,6,1,1}
#define MBC3_MEMORY_CFG_WORD_COUNT {3,0,0,0}
#define MBC_MEMORY_CFG_WORD_COUNT {MBC0_MEMORY_CFG_WORD_COUNT , MBC1_MEMORY_CFG_WORD_COUNT, MBC2_MEMORY_CFG_WORD_COUNT, MBC3_MEMORY_CFG_WORD_COUNT}
#define MBC0_MEMORY_NSE_WORD_COUNT {1,1,1,1}
#define MBC1_MEMORY_NSE_WORD_COUNT {1,1,1,1}
#define MBC2_MEMORY_NSE_WORD_COUNT {3,2,1,1}
#define MBC3_MEMORY_NSE_WORD_COUNT {1,0,0,0}
#define MBC_MEMORY_NSE_WORD_COUNT {MBC0_MEMORY_NSE_WORD_COUNT , MBC1_MEMORY_NSE_WORD_COUNT, MBC2_MEMORY_NSE_WORD_COUNT, MBC3_MEMORY_NSE_WORD_COUNT}


/* TRNG - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral TRNG0 base address */
  #define TRNG0_BASE                               (0x500EC000u)
  /** Peripheral TRNG0 base address */
  #define TRNG0_BASE_NS                            (0x400EC000u)
  /** Peripheral TRNG0 base pointer */
  #define TRNG0                                    ((TRNG_Type *)TRNG0_BASE)
  /** Peripheral TRNG0 base pointer */
  #define TRNG0_NS                                 ((TRNG_Type *)TRNG0_BASE_NS)
  /** Array initializer of TRNG peripheral base addresses */
  #define TRNG_BASE_ADDRS                          { TRNG0_BASE }
  /** Array initializer of TRNG peripheral base pointers */
  #define TRNG_BASE_PTRS                           { TRNG0 }
  /** Array initializer of TRNG peripheral base addresses */
  #define TRNG_BASE_ADDRS_NS                       { TRNG0_BASE_NS }
  /** Array initializer of TRNG peripheral base pointers */
  #define TRNG_BASE_PTRS_NS                        { TRNG0_NS }
#else
  /** Peripheral TRNG0 base address */
  #define TRNG0_BASE                               (0x400EC000u)
  /** Peripheral TRNG0 base pointer */
  #define TRNG0                                    ((TRNG_Type *)TRNG0_BASE)
  /** Array initializer of TRNG peripheral base addresses */
  #define TRNG_BASE_ADDRS                          { TRNG0_BASE }
  /** Array initializer of TRNG peripheral base pointers */
  #define TRNG_BASE_PTRS                           { TRNG0 }
#endif

/* USBHSDCD - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral USBHS1_PHY_DCD base address */
  #define USBHS1_PHY_DCD_BASE                      (0x5002F800u)
  /** Peripheral USBHS1_PHY_DCD base address */
  #define USBHS1_PHY_DCD_BASE_NS                   (0x4002F800u)
  /** Peripheral USBHS1_PHY_DCD base pointer */
  #define USBHS1_PHY_DCD                           ((USBHSDCD_Type *)USBHS1_PHY_DCD_BASE)
  /** Peripheral USBHS1_PHY_DCD base pointer */
  #define USBHS1_PHY_DCD_NS                        ((USBHSDCD_Type *)USBHS1_PHY_DCD_BASE_NS)
  /** Array initializer of USBHSDCD peripheral base addresses */
  #define USBHSDCD_BASE_ADDRS                      { USBHS1_PHY_DCD_BASE }
  /** Array initializer of USBHSDCD peripheral base pointers */
  #define USBHSDCD_BASE_PTRS                       { USBHS1_PHY_DCD }
  /** Array initializer of USBHSDCD peripheral base addresses */
  #define USBHSDCD_BASE_ADDRS_NS                   { USBHS1_PHY_DCD_BASE_NS }
  /** Array initializer of USBHSDCD peripheral base pointers */
  #define USBHSDCD_BASE_PTRS_NS                    { USBHS1_PHY_DCD_NS }
#else
  /** Peripheral USBHS1_PHY_DCD base address */
  #define USBHS1_PHY_DCD_BASE                      (0x4002F800u)
  /** Peripheral USBHS1_PHY_DCD base pointer */
  #define USBHS1_PHY_DCD                           ((USBHSDCD_Type *)USBHS1_PHY_DCD_BASE)
  /** Array initializer of USBHSDCD peripheral base addresses */
  #define USBHSDCD_BASE_ADDRS                      { USBHS1_PHY_DCD_BASE }
  /** Array initializer of USBHSDCD peripheral base pointers */
  #define USBHSDCD_BASE_PTRS                       { USBHS1_PHY_DCD }
#endif

/* USBNC - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral USBHS1NC base address */
  #define USBHS1NC_BASE                            (0x5002E200u)
  /** Peripheral USBHS1NC base address */
  #define USBHS1NC_BASE_NS                         (0x4002E200u)
  /** Peripheral USBHS1NC base pointer */
  #define USBHS1NC                                 ((USBNC_Type *)USBHS1NC_BASE)
  /** Peripheral USBHS1NC base pointer */
  #define USBHS1NC_NS                              ((USBNC_Type *)USBHS1NC_BASE_NS)
  /** Array initializer of USBNC peripheral base addresses */
  #define USBNC_BASE_ADDRS                         { USBHS1NC_BASE }
  /** Array initializer of USBNC peripheral base pointers */
  #define USBNC_BASE_PTRS                          { USBHS1NC }
  /** Array initializer of USBNC peripheral base addresses */
  #define USBNC_BASE_ADDRS_NS                      { USBHS1NC_BASE_NS }
  /** Array initializer of USBNC peripheral base pointers */
  #define USBNC_BASE_PTRS_NS                       { USBHS1NC_NS }
#else
  /** Peripheral USBHS1NC base address */
  #define USBHS1NC_BASE                            (0x4002E200u)
  /** Peripheral USBHS1NC base pointer */
  #define USBHS1NC                                 ((USBNC_Type *)USBHS1NC_BASE)
  /** Array initializer of USBNC peripheral base addresses */
  #define USBNC_BASE_ADDRS                         { USBHS1NC_BASE }
  /** Array initializer of USBNC peripheral base pointers */
  #define USBNC_BASE_PTRS                          { USBHS1NC }
#endif

/* USBPHY - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral USBHS1_PHY base address */
  #define USBHS1_PHY_BASE                          (0x5002F000u)
  /** Peripheral USBHS1_PHY base address */
  #define USBHS1_PHY_BASE_NS                       (0x4002F000u)
  /** Peripheral USBHS1_PHY base pointer */
  #define USBHS1_PHY                               ((USBPHY_Type *)USBHS1_PHY_BASE)
  /** Peripheral USBHS1_PHY base pointer */
  #define USBHS1_PHY_NS                            ((USBPHY_Type *)USBHS1_PHY_BASE_NS)
  /** Array initializer of USBPHY peripheral base addresses */
  #define USBPHY_BASE_ADDRS                        { USBHS1_PHY_BASE }
  /** Array initializer of USBPHY peripheral base pointers */
  #define USBPHY_BASE_PTRS                         { USBHS1_PHY }
  /** Array initializer of USBPHY peripheral base addresses */
  #define USBPHY_BASE_ADDRS_NS                     { USBHS1_PHY_BASE_NS }
  /** Array initializer of USBPHY peripheral base pointers */
  #define USBPHY_BASE_PTRS_NS                      { USBHS1_PHY_NS }
#else
  /** Peripheral USBHS1_PHY base address */
  #define USBHS1_PHY_BASE                          (0x4002F000u)
  /** Peripheral USBHS1_PHY base pointer */
  #define USBHS1_PHY                               ((USBPHY_Type *)USBHS1_PHY_BASE)
  /** Array initializer of USBPHY peripheral base addresses */
  #define USBPHY_BASE_ADDRS                        { USBHS1_PHY_BASE }
  /** Array initializer of USBPHY peripheral base pointers */
  #define USBPHY_BASE_PTRS                         { USBHS1_PHY }
#endif
/** Interrupt vectors for the USBPHY peripheral type */
#define USBPHY_IRQS                              { USB1_HS_PHY_IRQn }
/* Backward compatibility */
#define USBPHY_CTRL_ENDEVPLUGINDET_MASK     USBPHY_CTRL_ENDEVPLUGINDETECT_MASK
#define USBPHY_CTRL_ENDEVPLUGINDET_SHIFT    USBPHY_CTRL_ENDEVPLUGINDETECT_SHIFT
#define USBPHY_CTRL_ENDEVPLUGINDET(x)       USBPHY_CTRL_ENDEVPLUGINDETECT(x)
#define USBPHY_TX_TXCAL45DM_MASK            USBPHY_TX_TXCAL45DN_MASK
#define USBPHY_TX_TXCAL45DM_SHIFT           USBPHY_TX_TXCAL45DN_SHIFT
#define USBPHY_TX_TXCAL45DM(x)              USBPHY_TX_TXCAL45DN(x)



/* UTICK - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral UTICK0 base address */
  #define UTICK0_BASE                              (0x5000B000u)
  /** Peripheral UTICK0 base address */
  #define UTICK0_BASE_NS                           (0x4000B000u)
  /** Peripheral UTICK0 base pointer */
  #define UTICK0                                   ((UTICK_Type *)UTICK0_BASE)
  /** Peripheral UTICK0 base pointer */
  #define UTICK0_NS                                ((UTICK_Type *)UTICK0_BASE_NS)
  /** Array initializer of UTICK peripheral base addresses */
  #define UTICK_BASE_ADDRS                         { UTICK0_BASE }
  /** Array initializer of UTICK peripheral base pointers */
  #define UTICK_BASE_PTRS                          { UTICK0 }
  /** Array initializer of UTICK peripheral base addresses */
  #define UTICK_BASE_ADDRS_NS                      { UTICK0_BASE_NS }
  /** Array initializer of UTICK peripheral base pointers */
  #define UTICK_BASE_PTRS_NS                       { UTICK0_NS }
#else
  /** Peripheral UTICK0 base address */
  #define UTICK0_BASE                              (0x4000B000u)
  /** Peripheral UTICK0 base pointer */
  #define UTICK0                                   ((UTICK_Type *)UTICK0_BASE)
  /** Array initializer of UTICK peripheral base addresses */
  #define UTICK_BASE_ADDRS                         { UTICK0_BASE }
  /** Array initializer of UTICK peripheral base pointers */
  #define UTICK_BASE_PTRS                          { UTICK0 }
#endif
/** Interrupt vectors for the UTICK peripheral type */
#define UTICK_IRQS                               { UTICK0_IRQn }

